iDynamicsPackagesModules/Evaluations/legacyFiles/examplePolcies/Policy1_eval_Graph_dynamics/Policy1_evaluated_data/wrk2_response_data/output_result_2025_03_18_07_17.txt
Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080
  4 threads and 100 connections

  Thread calibration: mean lat.: 45.033ms, rate sampling interval: 326ms
  Thread calibration: mean lat.: 41.968ms, rate sampling interval: 159ms
  Thread calibration: mean lat.: 36.970ms, rate sampling interval: 139ms
  Thread calibration: mean lat.: 47.241ms, rate sampling interval: 327ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    40.67ms   51.43ms 207.74ms   87.17%
    Req/Sec     6.67      5.98    25.00     85.70%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.05ms
 75.000%   35.23ms
 90.000%  162.05ms
 99.000%  207.74ms
 99.900%  281.86ms
 99.990%  299.77ms
 99.999%  299.77ms
100.000%  299.77ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      11.927     0.000000            1         1.00
      12.839     0.100000          309         1.11
      13.119     0.200000          613         1.25
      13.359     0.300000          912         1.43
      13.647     0.400000         1229         1.67
      14.047     0.500000         1521         2.00
      14.415     0.550000         1672         2.22
      33.759     0.600000         1829         2.50
      34.303     0.650000         1977         2.86
      34.815     0.700000         2136         3.33
      35.231     0.750000         2285         4.00
      35.487     0.775000         2357         4.44
      35.871     0.800000         2433         5.00
      40.127     0.825000         2508         5.71
      60.735     0.850000         2584         6.67
     103.423     0.875000         2661         8.00
     145.151     0.887500         2698         8.89
     162.047     0.900000         2737        10.00
     162.943     0.912500         2783        11.43
     163.327     0.925000         2812        13.33
     163.967     0.937500         2855        16.00
     164.351     0.943750         2878        17.78
     164.735     0.950000         2892        20.00
     165.375     0.956250         2907        22.86
     166.271     0.962500         2928        26.67
     169.215     0.968750         2945        32.00
     175.871     0.971875         2954        35.56
     182.015     0.975000         2965        40.00
     185.727     0.978125         2973        45.71
     190.335     0.981250         2983        53.33
     193.279     0.984375         2992        64.00
     197.759     0.985938         2997        71.11
     200.959     0.987500         3002        80.00
     206.975     0.989062         3006        91.43
     208.127     0.990625         3011       106.67
     219.135     0.992188         3016       128.00
     220.287     0.992969         3018       142.22
     226.559     0.993750         3021       160.00
     229.119     0.994531         3023       182.86
     239.359     0.995313         3025       213.33
     241.023     0.996094         3028       256.00
     249.983     0.996484         3029       284.44
     251.263     0.996875         3030       320.00
     251.391     0.997266         3031       365.71
     254.207     0.997656         3032       426.67
     263.423     0.998047         3034       512.00
     263.423     0.998242         3034       568.89
     268.287     0.998437         3035       640.00
     268.287     0.998633         3035       731.43
     281.855     0.998828         3036       853.33
     285.439     0.999023         3037      1024.00
     285.439     0.999121         3037      1137.78
     285.439     0.999219         3037      1280.00
     285.439     0.999316         3037      1462.86
     286.207     0.999414         3038      1706.67
     286.207     0.999512         3038      2048.00
     286.207     0.999561         3038      2275.56
     286.207     0.999609         3038      2560.00
     286.207     0.999658         3038      2925.71
     299.775     0.999707         3039      3413.33
     299.775     1.000000         3039          inf
#[Mean    =       40.668, StdDeviation   =       51.432]
#[Max     =      299.520, Total count    =         3039]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  3341 requests in 2.00m, 2.60MB read
  Socket errors: connect 0, read 0, write 0, timeout 3384
Requests/sec:     27.83  
Transfer/sec:     22.18KB


Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080
  4 threads and 100 connections

  Thread calibration: mean lat.: 50.211ms, rate sampling interval: 270ms
  Thread calibration: mean lat.: 41.339ms, rate sampling interval: 149ms
  Thread calibration: mean lat.: 48.044ms, rate sampling interval: 332ms
  Thread calibration: mean lat.: 32.642ms, rate sampling interval: 73ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    44.15ms   60.34ms 259.71ms   87.89%
    Req/Sec     1.92      4.12    13.00     91.54%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.77ms
 75.000%   36.32ms
 90.000%  162.18ms
 99.000%  259.71ms
 99.900%  384.26ms
 99.990%  388.86ms
 99.999%  388.86ms
100.000%  388.86ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      12.207     0.000000            1         1.00
      13.447     0.100000           90         1.11
      13.799     0.200000          181         1.25
      14.055     0.300000          272         1.43
      14.351     0.400000          360         1.67
      14.767     0.500000          451         2.00
      15.183     0.550000          495         2.22
      34.751     0.600000          541         2.50
      35.359     0.650000          588         2.86
      35.775     0.700000          630         3.33
      36.319     0.750000          678         4.00
      36.607     0.775000          698         4.44
      37.215     0.800000          720         5.00
      47.647     0.825000          743         5.71
      64.127     0.850000          765         6.67
      91.455     0.875000          788         8.00
     116.223     0.887500          799         8.89
     162.175     0.900000          810        10.00
     164.735     0.912500          822        11.43
     165.631     0.925000          833        13.33
     168.063     0.937500          844        16.00
     169.087     0.943750          850        17.78
     186.751     0.950000          855        20.00
     209.663     0.956250          862        22.86
     223.231     0.962500          867        26.67
     225.279     0.968750          872        32.00
     228.607     0.971875          875        35.56
     238.079     0.975000          878        40.00
     241.023     0.978125          881        45.71
     243.071     0.981250          884        53.33
     243.711     0.984375          886        64.00
     252.287     0.985938          888        71.11
     254.207     0.987500          889        80.00
     259.711     0.989062          891        91.43
     260.607     0.990625          892       106.67
     264.191     0.992188          893       128.00
     266.239     0.992969          894       142.22
     286.463     0.993750          895       160.00
     293.375     0.994531          896       182.86
     293.375     0.995313          896       213.33
     316.415     0.996094          897       256.00
     316.415     0.996484          897       284.44
     383.999     0.996875          898       320.00
     383.999     0.997266          898       365.71
     383.999     0.997656          898       426.67
     384.255     0.998047          899       512.00
     384.255     0.998242          899       568.89
     384.255     0.998437          899       640.00
     384.255     0.998633          899       731.43
     384.255     0.998828          899       853.33
     388.863     0.999023          900      1024.00
     388.863     1.000000          900          inf
#[Mean    =       44.149, StdDeviation   =       60.340]
#[Max     =      388.608, Total count    =          900]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  990 requests in 2.00m, 793.02KB read
  Socket errors: connect 0, read 0, write 0, timeout 5075
Requests/sec:      8.25  
Transfer/sec:      6.61KB


Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080
  4 threads and 100 connections

  Thread calibration: mean lat.: 43.866ms, rate sampling interval: 320ms
  Thread calibration: mean lat.: 34.279ms, rate sampling interval: 115ms
  Thread calibration: mean lat.: 31.611ms, rate sampling interval: 117ms
  Thread calibration: mean lat.: 36.484ms, rate sampling interval: 160ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    39.31ms   49.63ms 203.52ms   87.67%
    Req/Sec    11.65      9.18    37.00     66.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.66ms
 75.000%   34.69ms
 90.000%  160.00ms
 99.000%  203.52ms
 99.900%  274.94ms
 99.990%  300.80ms
 99.999%  326.40ms
100.000%  326.40ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      11.743     0.000000            1         1.00
      12.543     0.100000          525         1.11
      12.799     0.200000         1067         1.25
      13.015     0.300000         1580         1.43
      13.263     0.400000         2102         1.67
      13.663     0.500000         2618         2.00
      14.079     0.550000         2878         2.22
      33.343     0.600000         3145         2.50
      33.855     0.650000         3404         2.86
      34.239     0.700000         3663         3.33
      34.687     0.750000         3939         4.00
      35.007     0.775000         4062         4.44
      35.423     0.800000         4190         5.00
      38.143     0.825000         4316         5.71
      58.847     0.850000         4448         6.67
      80.191     0.875000         4578         8.00
     114.495     0.887500         4643         8.89
     159.999     0.900000         4710        10.00
     161.151     0.912500         4781        11.43
     161.791     0.925000         4839        13.33
     162.431     0.937500         4921        16.00
     162.559     0.943750         4937        17.78
     162.943     0.950000         4976        20.00
     163.455     0.956250         5020        22.86
     163.711     0.962500         5043        26.67
     164.735     0.968750         5072        32.00
     165.375     0.971875         5084        35.56
     168.447     0.975000         5102        40.00
     173.055     0.978125         5117        45.71
     183.295     0.981250         5133        53.33
     188.671     0.984375         5150        64.00
     193.663     0.985938         5158        71.11
     195.583     0.987500         5166        80.00
     201.215     0.989062         5174        91.43
     204.927     0.990625         5183       106.67
     207.615     0.992188         5191       128.00
     211.071     0.992969         5195       142.22
     217.343     0.993750         5199       160.00
     224.255     0.994531         5203       182.86
     238.591     0.995313         5207       213.33
     247.423     0.996094         5211       256.00
     251.647     0.996484         5213       284.44
     256.895     0.996875         5215       320.00
     262.655     0.997266         5217       365.71
     264.191     0.997656         5220       426.67
     266.239     0.998047         5221       512.00
     266.495     0.998242         5222       568.89
     266.751     0.998437         5223       640.00
     270.335     0.998633         5224       731.43
     272.383     0.998828         5225       853.33
     274.943     0.999023         5226      1024.00
     284.159     0.999121         5227      1137.78
     284.159     0.999219         5227      1280.00
     297.215     0.999316         5228      1462.86
     297.215     0.999414         5228      1706.67
     300.031     0.999512         5229      2048.00
     300.031     0.999561         5229      2275.56
     300.031     0.999609         5229      2560.00
     300.799     0.999658         5230      2925.71
     300.799     0.999707         5230      3413.33
     300.799     0.999756         5230      4096.00
     300.799     0.999780         5230      4551.11
     300.799     0.999805         5230      5120.00
     326.399     0.999829         5231      5851.43
     326.399     1.000000         5231          inf
#[Mean    =       39.305, StdDeviation   =       49.627]
#[Max     =      326.144, Total count    =         5231]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5738 requests in 2.00m, 4.96MB read
  Socket errors: connect 0, read 0, write 0, timeout 2329
Requests/sec:     47.80  
Transfer/sec:     42.29KB


Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080
  4 threads and 100 connections

  Thread calibration: mean lat.: 34.901ms, rate sampling interval: 140ms
  Thread calibration: mean lat.: 43.400ms, rate sampling interval: 322ms
  Thread calibration: mean lat.: 38.643ms, rate sampling interval: 205ms
  Thread calibration: mean lat.: 38.305ms, rate sampling interval: 271ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    40.15ms   50.49ms 203.52ms   87.04%
    Req/Sec    16.47      9.51    43.00     75.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.53ms
 75.000%   34.56ms
 90.000%  160.64ms
 99.000%  203.52ms
 99.900%  274.94ms
 99.990%  297.47ms
 99.999%  298.49ms
100.000%  298.49ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      11.751     0.000000            1         1.00
      12.487     0.100000          759         1.11
      12.719     0.200000         1500         1.25
      12.943     0.300000         2230         1.43
      13.183     0.400000         2976         1.67
      13.527     0.500000         3713         2.00
      13.935     0.550000         4081         2.22
      33.247     0.600000         4462         2.50
      33.727     0.650000         4845         2.86
      34.111     0.700000         5217         3.33
      34.559     0.750000         5576         4.00
      34.879     0.775000         5759         4.44
      35.519     0.800000         5932         5.00
      45.727     0.825000         6118         5.71
      67.327     0.850000         6305         6.67
     103.231     0.875000         6489         8.00
     143.999     0.887500         6581         8.89
     160.639     0.900000         6685        10.00
     161.279     0.912500         6776        11.43
     161.791     0.925000         6872        13.33
     162.303     0.937500         6961        16.00
     162.559     0.943750         7009        17.78
     162.815     0.950000         7050        20.00
     163.199     0.956250         7099        22.86
     163.839     0.962500         7141        26.67
     165.119     0.968750         7188        32.00
     166.399     0.971875         7208        35.56
     171.135     0.975000         7230        40.00
     176.895     0.978125         7253        45.71
     184.319     0.981250         7277        53.33
     190.079     0.984375         7301        64.00
     192.127     0.985938         7311        71.11
     194.687     0.987500         7324        80.00
     198.527     0.989062         7334        91.43
     204.415     0.990625         7346       106.67
     207.999     0.992188         7358       128.00
     213.119     0.992969         7363       142.22
     215.551     0.993750         7369       160.00
     216.959     0.994531         7375       182.86
     219.391     0.995313         7381       213.33
     227.199     0.996094         7387       256.00
     228.223     0.996484         7389       284.44
     230.399     0.996875         7392       320.00
     236.415     0.997266         7395       365.71
     239.487     0.997656         7398       426.67
     254.463     0.998047         7401       512.00
     256.639     0.998242         7402       568.89
     262.911     0.998437         7404       640.00
     268.799     0.998633         7405       731.43
     272.895     0.998828         7407       853.33
     274.943     0.999023         7409      1024.00
     274.943     0.999121         7409      1137.78
     283.391     0.999219         7410      1280.00
     283.391     0.999316         7410      1462.86
     291.839     0.999414         7411      1706.67
     293.631     0.999512         7412      2048.00
     293.631     0.999561         7412      2275.56
     295.935     0.999609         7413      2560.00
     295.935     0.999658         7413      2925.71
     295.935     0.999707         7413      3413.33
     297.471     0.999756         7414      4096.00
     297.471     0.999780         7414      4551.11
     297.471     0.999805         7414      5120.00
     297.471     0.999829         7414      5851.43
     297.471     0.999854         7414      6826.67
     298.495     0.999878         7415      8192.00
     298.495     1.000000         7415          inf
#[Mean    =       40.152, StdDeviation   =       50.486]
#[Max     =      298.240, Total count    =         7415]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  8133 requests in 2.00m, 6.79MB read
  Socket errors: connect 0, read 0, write 0, timeout 1524
Requests/sec:     67.76  
Transfer/sec:     57.91KB